__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 56)           0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, 56, 256)      4803840     input_1[0][0]                    
__________________________________________________________________________________________________
reshape (Reshape)               (None, 56, 256, 1)   0           embedding[0][0]                  
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 55, 1, 128)   65664       reshape[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 54, 1, 128)   98432       reshape[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 53, 1, 128)   131200      reshape[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 28, 1, 128)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 27, 1, 128)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 27, 1, 128)   0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 1, 256)   65792       max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 27, 1, 256)   98560       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 27, 1, 256)   131328      max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 14, 1, 256)   0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 13, 1, 256)   0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 13, 1, 256)   0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 14, 1, 512)   262656      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 13, 1, 512)   393728      max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 13, 1, 512)   524800      max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 7, 1, 512)    0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 6, 1, 512)    0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 6, 1, 512)    0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 19, 1, 512)   0           max_pooling2d_6[0][0]            
                                                                 max_pooling2d_7[0][0]            
                                                                 max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 9728)         0           concatenate[0][0]                
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         9962496     flatten[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1024)         0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          131200      dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128)          0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2)            258         dropout_1[0][0]                  
==================================================================================================
Total params: 16,669,954
Trainable params: 16,669,954
Non-trainable params: 0
__________________________________________________________________________________________________


